import type { AccordionItem } from '@/shared/ui'

export const questionsItems: AccordionItem[] = [
  {
    content:
      'После регистрации перейдите в раздел "Добавить". Заполните все необходимые поля, такие как название, ингредиенты, пошаговая инструкция и фотографии. Нажмите "Поделиться", чтобы опубликовать рецепт.',
    trigger: 'Как добавить свой рецепт?',
  },
  {
    content:
      'Да, вы можете редактировать или удалять свои рецепты в разделе "Книга/Мои рецепты". Просто выберите рецепт и воспользуйтесь соответствующими опциями.',
    trigger: 'Могу ли я редактировать или удалять свои рецепты?',
  },
  {
    content:
      'Вы можете использовать поиск по ключевым словам или фильтры для поиска рецептов по категориям. Также можно просматривать популярные и новые рецепты на главной станице "Блюда".',
    trigger: 'Как найти рецепты других пользователей?',
  },
  {
    content:
      '"Книга рецептов" — это ваша персональная коллекция понравившихся рецептов. Вы можете добавлять в нее рецепты, которые хотите попробовать, и легко к ним возвращаться. ',
    trigger: 'Что такое "Книга рецептов"?',
  },
  {
    content:
      'Чтобы участвовать в мероприятиях, перейдите в раздел "Сообщество" и выберите интересующее вас событие. Вы можете зарегистрироваться или создать свое собственное мероприятие.',
    trigger: 'Как участвовать в мероприятиях?',
  },
  {
    content:
      'Да, вы можете оставлять комментарии к рецептам, которые попробовали. Это поможет другим пользователям узнать о вашем опыте и впечатлениях.',
    trigger: 'Могу ли я оставлять комментарии к рецептам?',
  },
]
